//========= Copyright Valve Corporation, All rights reserved. ============//
//
// Purpose: Abstract away and help with platform-specific code.
//
// $NoKeywords: $
// TODO: Move as much as possible to CMake, less moving parts are good
//
//===========================================================================//
#pragma once
#include "basetypes.h"
#include "tier0/valve_off.h"
#include "wchartypes.h"

#if defined( PLATFORM_POSIX )
	#include <alloca.h> // need this for _alloca
	#include <unistd.h>
	#include <ctime>
#endif

#include <malloc.h>
#include <new>

// need this for memset
#include <cstring>

//-----------------------------------------------------------------------------
// Set up platform type defines.
//-----------------------------------------------------------------------------
#if defined( PLATFORM_64BITS )
	#define IsPlatform64Bits() true
#else
	#define IsPlatform64Bits() false
#endif
#if defined( PLATFORM_DEBUG )
	#define IsDebug() true
#else
	#define IsDebug() false
#endif
#if defined( PLATFORM_RETAIL )
	#define IsRetail() true
#else
	#define IsRetail() false
#endif
#if defined( PLATFORM_RELEASE )
	#define IsRelease() true
#else
	#define IsRelease() false
#endif

#define IsPC() true
#define IsConsole() false
#define IsWindows() false
#define IsPlatformWindowsPC32() false
#define IsPlatformWindowsPC64() false
#define IsPlatformOpenGL() false
#define IsPosix() false
#define IsLinux() false

#if defined( PLATFORM_WINDOWS )
	#undef IsWindows
	#define IsWindows() true

	#if defined( PLATFORM_64BITS )
		#undef IsPlatformWindowsPC64
		#define IsPlatformWindowsPC64() true
	#else
		#undef IsPlatformWindowsPC32
		#define IsPlatformWindowsPC32() true
	#endif
	// Adding IsPlatformOpenGL() to help fix a bunch of code that was using IsPosix() to infer if the DX->GL translation layer was being used.
	#if defined( DX_TO_GL_ABSTRACTION )
		#udnef IsPlatformOpenGL
		#define IsPlatformOpenGL() true
	#endif
#elif defined( PLATFORM_POSIX )
	#undef IsPosix
	#define IsPosix() true

	#undef IsPlatformOpenGL
	#define IsPlatformOpenGL() true
	#define __cdecl  // override __cdecl to be nothing, used in some places (for now >:3) NOLINT(*-reserved-identifier)

	#if defined( PLATFORM_LINUX )
		#undef IsLinux
		#define IsLinux() true
	#endif
#else
	#error "Unsupported platform, please implement!"
#endif

typedef unsigned char uint8;
typedef signed char int8;

#if IsWindows()
	typedef   signed __int16  int16;
	typedef unsigned __int16 uint16;
	typedef   signed __int32  int32;
	typedef unsigned __int32 uint32;
	typedef   signed __int64  int64;
	typedef unsigned __int64 uint64;
	#if IsPlatform64Bits()
		typedef   signed __int64  intp;
		typedef unsigned __int64 uintp;
	#else
		typedef   signed __int32  intp;
		typedef unsigned __int32 uintp;
	#endif
#else
	typedef   signed short     int16;
	typedef unsigned short     uint16;
	typedef   signed int       int32;
	typedef unsigned int       uint32;
	typedef   signed long long int64;
	typedef unsigned long long uint64;
	#if IsPlatform64Bits()
		typedef long long intp;
		typedef unsigned long long uintp;
	#else
		typedef int intp;
		typedef unsigned int uintp;
	#endif
	typedef void* HWND;
#endif

// From `steam/steamtypes.h`: RTime32
// We use this 32 bit time representing real world time.
// It offers 1 second resolution beginning on January 1, 1970 (Unix time)
typedef uint32 RTime32;

typedef float float32;
typedef double float64;

// for when we don't care about how many bits we use
typedef unsigned int uint;

// Check that the various sized types have the size we expect
static_assert( sizeof(  int16 ) == 2 );
static_assert( sizeof( uint16 ) == 2 );
static_assert( sizeof(  int32 ) == 4 );
static_assert( sizeof( uint32 ) == 4 );
static_assert( sizeof(  int64 ) == 8 );
static_assert( sizeof( uint64 ) == 8 );
static_assert( sizeof(  intp ) == sizeof(void*) ); // intp is an integer that can accommodate a pointer
static_assert( sizeof( uintp ) == sizeof(void*) ); //  ( ie, sizeof(intp) >= sizeof(int) && sizeof(intp) >= sizeof(void *) )

// TODO: Verify if this is still needed, with most probability not.
#if defined( COMPILER_MSVC )
	#pragma once
	// Ensure that everybody has the right compiler version installed. The version
	// number can be obtained by looking at the compiler output when you type 'cl'
	// and removing the last two digits and the periods: 16.00.40219.01 becomes 160040219
	#if _MSC_FULL_VER > 180000000
		#if _MSC_FULL_VER < 180030723
			#error You must install VS 2013 Update 3
		#endif
	#elif _MSC_FULL_VER > 160000000
		#if _MSC_FULL_VER < 160040219
			#error You must install VS 2010 SP1
		#endif
	#else
		#if _MSC_FULL_VER < 140050727
			#error You must install VS 2005 SP1
		#endif
	#endif
#endif

